Autodesk.Revit.DB.KeyBasedTreeEntryError.GetEntry
Gets the entry for which an error occurred while building the KeyBasedTreeEntries object.
Returns:
A copy of the KeyBasedTreeEntry.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntryError.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.KeyBasedTreeEntryError.ErrorType
Indicates which of possible types of problems with loading and/or building
a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntryError
This class contains information about a problem encountered while creating a KeyBasedTreeEntries object.
Remarks:
This problem might be a duplicate entry, or an error in the
specified parent-child relationships, or something else. See BuiltInKeyBasedTreeEntryErrorType for details.
Since:
2015